[
  {   
      "name": "Home",
      "story": "‘Thank you for letting me stay, grandma, I’m sure this is exactly what I need.’ It’s not quite a lie, you’re sure the cabin in the woods will be the perfect place to escape your distractions and finish your final project before it’s due at 11:59 PM. There’s just something about being here that has you on edge though...something you can’t quite put your finger on. Oh well, you shake the feeling and look around at the old place. ‘Well, I’m here for a reason and it’s already 6PM’, you say, ‘let’s go!’ and you dive in to work once again.  BANG BANG! It sounds like someone is beating on the door.  ‘That’s weird… grandma said no one should be in the area for days…’ BANG BANG BANG, it’s more persistent this time.  You get up nervously and open the door only to find no one is there.  When you turn to go back inside, you realize the door has shut behind you and is locked with your keys inside. On the door, someone has left a note for you: ‘I have a spare key but you’ll have to find me’  You look at your watch and realize it’s already 6:30 PM, and you have only hours to go before your project has to be turned in. ‘Grandma always said there was a groundskeeper, uh, somewhere?’  You should really start paying more attention...but for now, you have to start looking.  Do you want to go EAST and take your chance in the woods or WEST towards what grandma always called ‘the enchanted meadow’?",
      "image": "images/home.jpeg",
      "movement": {
        "N": "Woods (Travel East)",
        "E": "Meadow (Travel West)"
      }
  },
  {
      "name": "Woods",
      "story": "You leave the house and head EAST, and you are starting to feel anxious. You haven’t been in these particular woods since… ‘stop it, that wasn’t real’, you tell yourself and push on.  ‘The faster I find the person who left me the key, the sooner I can get back to coding.’  You walk along the trail from the house for a little while, noticing that it’s getting darker and darker the further you go.  You have a strange feeling of being watched, but shake it off. You start to hear a rushing sound, and as you turn the corner you see a large river. You look around, noticing that the path entrance is blocked to the NORTH by fallen trees, but just beyond it, it hugs the river’s winding path deeper into the woods.  To your right, the path is clear and well lit with a wooden sign directing you toward the … ‘come on, seriously?’ … cemetery. You look down at your watch and notice it’s 7:42 PM -- time to decide. ‘Well, here goes nothing’ you say, and turn...",
      "image": "images/woods.jpg",
      "movement": {
        "N": "River (Travel North)",
        "E": "Cemetery (Travel South)"
      }
  },
  {
      "name": "River",
      "story": "...NORTH toward the river. ‘Nope, nope, nope. Cemetery rhymes with super scary. Not making the same mistake twice, real or imagined.’ You climb around the fallen trees and drop back down to the path, noticing you are now in complete silence, not even the mosquitos are buzzing. You pick up the pace a little bit, looking all over for any signs of the person who left you that note. You continue walking by the river noticing it’s becoming larger & larger.  To the WEST you begin to see the terrain is climbing upwards. Suddenly, you can see the orange glow of a fire in the distance and head toward it.  ‘What was that?’ as a branch snaps somewhere off the path, but fairly close.  You stop moving, but all you hear is silence pressing in on you. ‘I bet they’re camping out by the fire just waiting for me to get there so they can have a good laugh at my expense.’  You enter the clearing and see the fire roaring, but there is no one in sight.  ‘He he he’, you hear to the EAST which looks to be turning into a swamp land this deep in the woods. At the same time, you hear scrambling from the WEST, like someone is trying to hide from you by climbing rocky path up the cliff. Where do you go next?",
      "image": "images/River.jpeg",
      "movement": {
        "N": "Cliff (Travel West)",
        "E": "Swamp (Travel East)"
      }
  },
  {
      "name": "Swamp",
      "story": "You turn EAST. Not nearly as confident as you were leaving the house, but desperately needing to get the key and get back home, you head in the direction where you know someone is hiding. You stop suddenly after hearing the laugh again. It’s louder, and now it sounds like more than one person, but you can’t pinpoint where it’s coming from.  You head deeper into the swamp.  ‘There!’ you think as you start seeing shadows running between the trees. ‘Hello? I know you’re out there. I just need the key so I can …’ When you wake up, you’re sitting in a circle in front of a group of women. ‘Where am I? Who are you? What do you want?’ you shout, and then more importantly ‘WHAT TIME IS IT?’ but they aren’t interested in giving you answers and continue staring at you in silence. Grandma always told some old wives tale about a coven of witches in the swamp, but you never thought that could be true. You are officially freaked out.  ‘Sisters, the time has come to invite a new soul to join us.’ The leader turns to you and stands up.  ‘We know what you want. The key to your grandma’s house.  We do not have it, but we can get you back inside without a doubt. All you need to do is pledge your soul to us. If you refuse, well...’ she closes her mouth and you hear a peal of giggles from the rest of the group. Oh okay… no big deal right? You take a minute and assess the situation you are in. You take a deep breath and answer...",
      "image": "images/Swamp.jpg",
      "movement": {
        "N": "Join Coven",
        "E": "Reject Invitation"
      }
  },
  {
      "name": "Cliff",
      "story": "this is the cliff story",
      "image": "images/Cliff.jpeg",
      "movement": {
        "N": "Climb Down",
        "E": "Use the Parachute"
      }
  },
  {
      "name": "Cemetery",
      "story": "like greenwood",
      "image": "images/cemetery.jpg",
      "movement": {
        "N": "Castle (Travel South)",
        "E": "Church (Travel West)"
      }
  },
  {
      "name": "Castle",
      "story": "eureka's castle",
      "image": "images/castle.jpg",
      "movement": {
        "N": "Look",
        "E": "Keep Your Eyes Closed"
      }
  },
  {
      "name": "Church",
      "story": "the church one",
      "image": "images/Church.jpg",
      "movement": {
        "N": "Sneak There",
        "E": "Run!"
      }
  },
  {
      "name": "Meadow",
      "story": "This talks about what happens when you go to the meadow",
      "image": "images/meadow.jpg",
      "movement": {
        "N": "Mountains (Travel North)",
        "E": "Hidden Path (Travel South)"
      }
  },
  {
      "name": "Mountains",
      "story": "The mountain choice",
      "image": "images/mountain.jpeg",
      "movement": {
        "N": "Summit (Travel West)",
        "E": "Shack (Travel East)"
      }
  },
  {
      "name": "Summit",
      "story": "The summit one",
      "image": "images/summit.jpg",
      "movement": {
        "N": "Participate",
        "E": "Politely Decline"
      }
  },
  {
      "name": "Shack",
      "story": "The shack one",
      "image": "images/shack.jpeg",
      "movement": {
        "N": "Fight",
        "E": "Sled"
      }
  },
  {
      "name": "Hidden Path",
      "story": "the hidden path option",
      "image": "images/Hidden_Path.jpeg",
      "movement": {
        "N": "Abandoned Village (Travel South)",
        "E": "Quick Sand (Travel West)"
      }
  },
  {
      "name": "Abandoned Village",
      "story": "this looks suspiciously dangerous",
      "image": "images/hidden_village.jpg",
      "movement": {
        "N": "Disguise Yourself",
        "E": "Fight Your Way Out"
      }
  },
  {
      "name": "Quick Sand",
      "story": "seriously does anyone ever survive this?",
      "image": "images/Quick_Sand.jpeg",
      "movement": {
        "N": "Try to go over it",
        "E": "Try to go through it"
      }
  },
  {
    "name": "Join Coven",
    "story": "peer pressure - you win tho",
    "image": "images/join_coven.jpeg",
    "movement": {
        "N": "Play Again?",
        "E": null
        }
  },
  {
    "name": "Reject Invitation",
    "story": "nope - they didn't like that - you lose",
    "image": "images/reject_invitation.jpeg",
    "movement": {
      "N": "Play Again?",
      "E": null
      }
  },
  {
    "name": "Climb Down",
    "story": "try to climb down a mountain, go ahead",
    "image": "images/climb_down.jpg",
    "movement": {
      "N": "Play Again?",
      "E": null
     }
  },
  {
    "name": "Use the Parachute",
    "story": "I mean, it's here right?",
    "image": "images/parachute.jpeg",
    "movement": {
      "N": "Play Again?",
      "E": null
    }
  },
  {
    "name": "Look",
    "story": "open your eyes fam",
    "image": "images/Look.jpeg",
    "movement": {
      "N": "Play Again?",
      "E": null
    }
  },
  {
    "name": "Keep Your Eyes Closed",
    "story": "no peeking",
    "image": "images/eyes_closed.jpeg",
    "movement": {
      "N": "Play Again?",
      "E": null
    }
  },
  {
    "name": "Sneak There",
    "story": "tip toe",
    "image": "images/sneak.jpeg",
    "movement": {
      "N": "Play Again?",
      "E": null
    }
  },
  {
    "name": "Run!",
    "story": "let's goo",
    "image": "images/run.jpeg",
    "movement": {
      "N": "Play Again?",
      "E": null
    }
  },
  {
    "name": "Participate",
    "story": "downward facing dog",
    "image": "images/participate.jpg",
    "movement": {
      "N": "Play Again?",
      "E": null
    }
  },
  {
    "name": "Politely Decline",
    "story": "i can't touch my toes irl",
    "image": "images/decline.jpeg",
    "movement": {
      "N": "Play Again?",
      "E": null
    }
  },
  {
    "name": "Fight",
    "story": "snowball, to clarify",
    "image": "images/fight.png",
    "movement": {
      "N": "Play Again?",
      "E": null
    }
  },
  {
    "name": "Sled",
    "story": "it'll be fun too",
    "image": "images/sled.jpg",
    "movement": {
      "N": "Play Again?",
      "E": null
    }
  },
  {
    "name": "Disguise Yourself",
    "story": "like the walking dead",
    "image": "images/disguise.jpeg",
    "movement": {
      "N": "Play Again?",
      "E": null
    }
  },
  {
    "name": "Fight Your Way Out",
    "story": "also like the walking dead",
    "image": "images/fight_zombies.jpeg",
    "movement": {
      "N": "Play Again?",
      "E": null
    }
  },
  {
    "name": "Try to go over it",
    "story": "vine",
    "image": "images/over_it.jpeg",
    "movement": {
      "N": "Play Again?",
      "E": null
    }
  },
  {
    "name": "Try to go through it",
    "story": "not the best plan",
    "image": "images/thru.jpeg",
    "movement": {
      "N": "Play Again?",
      "E": null
    }
  }
]
